### Planned Changes to Server Infrastructure
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_string.resource_code: Refreshing state... [id=nkljj14f]
module.server.random_password.password: Refreshing state... [id=none]
github_repository_environment.this: Refreshing state... [id=indok-api:production]
module.server.module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f]
module.server.data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Reading...
module.server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.module.managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.ManagedIdentity/userAssignedIdentities/managed-identity-nkljj14f]
module.server.module.container_app.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.OperationalInsights/workspaces/container-app-nkljj14f]
module.server.module.database.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.DBforPostgreSQL/flexibleServers/postgres-nkljj14f]
module.server.module.redis.azurerm_redis_cache.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.Cache/redis/redis-nkljj14f]
github_actions_environment_variable.this["azure_subscription_id"]: Refreshing state... [id=indok-api:production:AZURE_SUBSCRIPTION_ID]
github_actions_environment_variable.this["azure_tenant_id"]: Refreshing state... [id=indok-api:production:AZURE_TENANT_ID]
github_actions_environment_variable.this["azure_client_id"]: Refreshing state... [id=indok-api:production:AZURE_CLIENT_ID]
module.server.module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.KeyVault/vaults/key-vault-nkljj14f]
module.server.module.database.azurerm_postgresql_flexible_server_database.example: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.DBforPostgreSQL/flexibleServers/postgres-nkljj14f/databases/postgres-nkljj14f]
module.server.module.container_app.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.App/managedEnvironments/container-app-nkljj14f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.server.azurerm_key_vault_secret.db_connection_string will be created
  + resource "azurerm_key_vault_secret" "db_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.KeyVault/vaults/key-vault-nkljj14f"
      + name                    = "db-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.server.azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.KeyVault/vaults/key-vault-nkljj14f"
      + name                    = "redis-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.server.azurerm_role_assignment.service_principal will be created
  + resource "azurerm_role_assignment" "service_principal" {
      + description                      = "Manage all resources in the resource group rg-nkljj14f"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f57bbcb8-e573-4d96-bcc2-442d630c476a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.server.module.container_app.azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.App/managedEnvironments/container-app-nkljj14f"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "container-app-nkljj14f"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-nkljj14f"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "production"
          + "workspace"   = "default"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 4000
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "docker-registry-password"
          + server               = "ghcr.io"
          + username             = "USERNAME"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/rubberdok/server:1159fe47b6b4c83a5a41f3eae07cda3736394d3a"
              + memory            = "0.5Gi"
              + name              = "server"

              + env {
                  + name        = "REDIS_CONNECTION_STRING"
                  + secret_name = "redis-connection-string"
                }
              + env {
                  + name        = "DATABASE_CONNECTION_STRING"
                  + secret_name = "database-connection-string"
                }
              + env {
                  + name  = "CORS_ORIGINS"
                  + value = "https://indokntnu.no"
                }
              + env {
                  + name  = "CORS_CREDENTIALS"
                  + value = "true"
                }
              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "NO_REPLY_EMAIL"
                  + value = "no-reply@indokntnu.no"
                }
              + env {
                  + name  = "PORT"
                  + value = "4000"
                }
              + env {
                  + name  = "FEIDE_CLIENT_ID"
                  + value = "abc"
                }
              + env {
                  + name  = "FEIDE_CLIENT_SECRET"
                  + value = "abc"
                }
              + env {
                  + name  = "FEIDE_REDIRECT_URI"
                  + value = "https://indokntnu.no/api/auth/feide/callback"
                }
              + env {
                  + name  = "FEIDE_BASE_URL"
                  + value = "https://auth.dataporten.no"
                }
              + env {
                  + name  = "FEIDE_VERIFIER_SECRET"
                  + value = "abc"
                }
              + env {
                  + name  = "POSTMARK_API_TOKEN"
                  + value = "abc"
                }
              + env {
                  + name  = "SESSION_SECRET"
                  + value = "abc"
                }
              + env {
                  + name  = "SESSION_COOKIE_NAME"
                  + value = "abc"
                }
              + env {
                  + name  = "SESSION_COOKIE_DOMAIN"
                  + value = "abc"
                }
              + env {
                  + name  = "SESSION_COOKIE_HTTP_ONLY"
                  + value = "abc"
                }
              + env {
                  + name  = "SESSION_COOKIE_SECURE"
                  + value = "abc"
                }
            }
        }
    }

  # module.server.module.key_vault.azurerm_role_assignment.key_vault_officer will be created
  + resource "azurerm_role_assignment" "key_vault_officer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cb1576bb-2618-45a0-8363-0575d7e7e412"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.KeyVault/vaults/key-vault-nkljj14f"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.server.module.key_vault.azurerm_role_assignment.key_vault_user will be created
  + resource "azurerm_role_assignment" "key_vault_user" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f57bbcb8-e573-4d96-bcc2-442d630c476a"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-nkljj14f/providers/Microsoft.KeyVault/vaults/key-vault-nkljj14f"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*